blog.org
#+TITLE: Ilghar Kus 的 Blog
#+OPTIONS: num:0

* Before reading
这里是我的一些想法以及心情的汇总，如果想看技术类文章请返回到主页并在 =Articles= 栏中点选。

* Blogs
** 2020/10/12 
今天是开通Blog功能的第一天。

本来我把我写的那些文章叫做Blog，后来想想有些不对劲，应该叫做Articles，Blog应该是用来记录自己的一些想法和心情用的。

于是就换了。

然后我就开始在这个页面上写Blog。

感觉还不错，至少不用写什么智障的朋友圈和QQ空间了。

连基本的富文本格式都不支持。

好的，我现在有点闲时间了，准备仔细讲一下我的这个个人站点是如何运行的。

首先，你们看到的所有HTML页面都是我在本地写完OrgFile之后用 =ox-twbs= 这个插件Export成HTML文档。

这个插件应该是Hackable的，但是具体的方式我还没有来得及开整，最近读书读疯了，学校的作业都快没时间做。

比如我用org-mode写完了一篇文章，然后将它导出为了HTML格式储存在OrgFile所在文件夹内，（一般的博客文章都是在 =./articles= ）

然后我就打开index.org在 =articles= 一栏加入我新写的那篇文章的orgfile的链接（默认快捷键是 =C-c C-l= ）

（其实严格意义上来说是要插入html链接，但是我实验过ox-twbs会自动将指向orgfile的文件替换成指向对应的HTML文件链接）

然后导出HTML，然后执行一个自己写的函数，自动完成 = git commit && git push = 一系列流程。

我觉得我有能力把在index.org里插入链接的事写个elisp函数自动化，但是因为太忙而且太懒一直没兴趣和动力去做。

整个流程大概就是以上。
