blog.html
<!doctype html>
<html lang="en">
<head>
<title>Ilghar Kus 的 Blog</title>
<!-- 2020-10-12 Mon 18:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-">Before reading</a></li>
<li><a href="#sec-">Blogs</a>
<ul class="nav">
<li><a href="#sec-">2020/10/12</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Ilghar Kus 的 Blog</h1>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Before reading</h2>
<div class="outline-text-2" id="text-">
<p>
这里是我的一些想法以及心情的汇总，如果想看技术类文章请返回到主页并在 <code>Articles</code> 栏中点选。
</p>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Blogs</h2>
<div class="outline-text-2" id="text-">
</div><div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">2020/10/12</h3>
<div class="outline-text-3" id="text-">
<p>
今天是开通Blog功能的第一天。
</p>

<p>
本来我把我写的那些文章叫做Blog，后来想想有些不对劲，应该叫做Articles，Blog应该是用来记录自己的一些想法和心情用的。
</p>

<p>
于是就换了。
</p>

<p>
然后我就开始在这个页面上写Blog。
</p>

<p>
感觉还不错，至少不用写什么智障的朋友圈和QQ空间了。
</p>

<p>
连基本的富文本格式都不支持。
</p>

<p>
好的，我现在有点闲时间了，准备仔细讲一下我的这个个人站点是如何运行的。
</p>

<p>
首先，你们看到的所有HTML页面都是我在本地写完OrgFile之后用 <code>ox-twbs</code> 这个插件Export成HTML文档。
</p>

<p>
这个插件应该是Hackable的，但是具体的方式我还没有来得及开整，最近读书读疯了，学校的作业都快没时间做。
</p>

<p>
比如我用org-mode写完了一篇文章，然后将它导出为了HTML格式储存在OrgFile所在文件夹内，（一般的博客文章都是在 <code>./articles</code> ）
</p>

<p>
然后我就打开index.org在 <code>articles</code> 一栏加入我新写的那篇文章的orgfile的链接（默认快捷键是 <code>C-c C-l</code> ）
</p>

<p>
（其实严格意义上来说是要插入html链接，但是我实验过ox-twbs会自动将指向orgfile的文件替换成指向对应的HTML文件链接）
</p>

<p>
然后导出HTML，然后执行一个自己写的函数，自动完成 = git commit &amp;&amp; git push = 一系列流程。
</p>

<p>
我觉得我有能力把在index.org里插入链接的事写个elisp函数自动化，但是因为太忙而且太懒一直没兴趣和动力去做。
</p>

<p>
整个流程大概就是以上。
</p>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="date">Created: 2020-10-12 Mon 18:14</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="http://orgmode.org">Org-mode</a> 9.3)</p>
</div>
</footer>
</body>
</html>
